stm32duino/Arduino_Core_STM32/cores/arduino/stm32/timer.c
/**
  ******************************************************************************
  * @file    timer.c
  * @author  WI6LABS
  * @version V1.0.0
  * @date    01-August-2016
  * @brief   provide timer services
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2016 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup stm32f4xx_system
  * @{
  */

/** @addtogroup STM32F4xx_System_Private_Includes
  * @{
  */
#include "timer.h"
#include "board.h"

#ifdef __cplusplus
 extern "C" {
#endif

/**
  * @}
  */

/** @addtogroup STM32F4xx_System_Private_TypesDefinitions
  * @{
  */

/**
  * @}
  */

/** @addtogroup STM32F4xx_System_Private_Defines
  * @{
  */

/**
  * @}
  */

/** @addtogroup STM32F4xx_System_Private_FunctionPrototypes
* @{
*/

static void HAL_TIMx_PeriodElapsedCallback(stimer_t *obj);

/**
  * @}
  */

/** @addtogroup STM32F4xx_System_Private_Macros
  * @{
  */

/**
  * @}
  */

/** @addtogroup STM32F4xx_System_Private_Variables
  * @{
  */

#define TIMER_NUM (22)
static TIM_HandleTypeDef* timer_handles[TIMER_NUM] = {NULL};


/**
  * @}
  */

/**
  * @brief  Enable the timer clock
  * @param  htim : one of the defined timer
  * @retval None
  */
void timer_enable_clock(TIM_HandleTypeDef *htim)
{
// Enable TIM clock
#if defined(TIM1_BASE)
  if (htim->Instance == TIM1){
      __HAL_RCC_TIM1_CLK_ENABLE();
      timer_handles[0] = htim;
  }
#endif
#if defined(TIM2_BASE)
  if (htim->Instance == TIM2) {
      __HAL_RCC_TIM2_CLK_ENABLE();
      timer_handles[1] = htim;
  }
#endif
#if defined(TIM3_BASE)
  if (htim->Instance == TIM3) {
      __HAL_RCC_TIM3_CLK_ENABLE();
      timer_handles[2] = htim;
  }
#endif
#if defined(TIM4_BASE)
  if (htim->Instance == TIM4) {
      __HAL_RCC_TIM4_CLK_ENABLE();
      timer_handles[3] = htim;
  }
#endif
#if defined(TIM5_BASE)
  if (htim->Instance == TIM5) {
      __HAL_RCC_TIM5_CLK_ENABLE();
      timer_handles[4] = htim;
  }
#endif
#if defined(TIM6_BASE)
  if (htim->Instance == TIM6) {
      __HAL_RCC_TIM6_CLK_ENABLE();
      timer_handles[5] = htim;
  }
#endif
#if defined(TIM7_BASE)
  if (htim->Instance == TIM7) {
      __HAL_RCC_TIM7_CLK_ENABLE();
      timer_handles[6] = htim;
  }
#endif
#if defined(TIM8_BASE)
  if (htim->Instance == TIM8) {
      __HAL_RCC_TIM8_CLK_ENABLE();
      timer_handles[7] = htim;
  }
#endif
#if defined(TIM9_BASE)
  if (htim->Instance == TIM9) {
      __HAL_RCC_TIM9_CLK_ENABLE();
      timer_handles[8] = htim;
  }
#endif
#if defined(TIM10_BASE)
  if (htim->Instance == TIM10) {
      __HAL_RCC_TIM10_CLK_ENABLE();
      timer_handles[9] = htim;
  }
#endif
#if defined(TIM11_BASE)
  if (htim->Instance == TIM11) {
      __HAL_RCC_TIM11_CLK_ENABLE();
      timer_handles[10] = htim;
  }
#endif
#if defined(TIM12_BASE)
  if (htim->Instance == TIM12) {
      __HAL_RCC_TIM12_CLK_ENABLE();
      timer_handles[11] = htim;
  }
#endif
#if defined(TIM13_BASE)
  if (htim->Instance == TIM13) {
      __HAL_RCC_TIM13_CLK_ENABLE();
      timer_handles[12] = htim;
  }
#endif
#if defined(TIM14_BASE)
  if (htim->Instance == TIM14) {
      __HAL_RCC_TIM14_CLK_ENABLE();
      timer_handles[13] = htim;
  }
#endif
#if defined(TIM15_BASE)
  if (htim->Instance == TIM15) {
      __HAL_RCC_TIM15_CLK_ENABLE();
      timer_handles[14] = htim;
  }
#endif
#if defined(TIM16_BASE)
  if (htim->Instance == TIM16) {
      __HAL_RCC_TIM16_CLK_ENABLE();
      timer_handles[15] = htim;
  }
#endif
#if defined(TIM17_BASE)
  if (htim->Instance == TIM17) {
      __HAL_RCC_TIM17_CLK_ENABLE();
      timer_handles[16] = htim;
  }
#endif
#if defined(TIM18_BASE)
  if (htim->Instance == TIM18) {
      __HAL_RCC_TIM18_CLK_ENABLE();
      timer_handles[17] = htim;
  }
#endif
#if defined(TIM19_BASE)
  if (htim->Instance == TIM19) {
      __HAL_RCC_TIM19_CLK_ENABLE();
      timer_handles[18] = htim;
  }
#endif
#if defined(TIM20_BASE)
  if (htim->Instance == TIM20) {
      __HAL_RCC_TIM20_CLK_ENABLE();
      timer_handles[19] = htim;
  }
#endif
#if defined(TIM21_BASE)
  if (htim->Instance == TIM21) {
      __HAL_RCC_TIM21_CLK_ENABLE();
      timer_handles[20] = htim;
  }
#endif
#if defined(TIM22_BASE)
  if (htim->Instance == TIM22) {
      __HAL_RCC_TIM22_CLK_ENABLE();
      timer_handles[21] = htim;
  }
#endif
}

/**
  * @brief  Disable the timer clock
  * @param  htim : one of the defined timer
  * @retval None
  */
void timer_disable_clock(TIM_HandleTypeDef *htim)
{
// Enable TIM clock
#if defined(TIM1_BASE)
  if (htim->Instance == TIM1){
      __HAL_RCC_TIM1_CLK_DISABLE();
  }
#endif
#if defined(TIM2_BASE)
  if (htim->Instance == TIM2) {
      __HAL_RCC_TIM2_CLK_DISABLE();
  }
#endif
#if defined(TIM3_BASE)
  if (htim->Instance == TIM3) {
      __HAL_RCC_TIM3_CLK_DISABLE();
  }
#endif
#if defined(TIM4_BASE)
  if (htim->Instance == TIM4) {
      __HAL_RCC_TIM4_CLK_DISABLE();
  }
#endif
#if defined(TIM5_BASE)
  if (htim->Instance == TIM5) {
      __HAL_RCC_TIM5_CLK_DISABLE();
  }
#endif
#if defined(TIM6_BASE)
  if (htim->Instance == TIM6) {
      __HAL_RCC_TIM6_CLK_DISABLE();
  }
#endif
#if defined(TIM7_BASE)
  if (htim->Instance == TIM7) {
      __HAL_RCC_TIM7_CLK_DISABLE();
  }
#endif
#if defined(TIM8_BASE)
  if (htim->Instance == TIM8) {
      __HAL_RCC_TIM8_CLK_DISABLE();
  }
#endif
#if defined(TIM9_BASE)
  if (htim->Instance == TIM9) {
      __HAL_RCC_TIM9_CLK_DISABLE();
  }
#endif
#if defined(TIM10_BASE)
  if (htim->Instance == TIM10) {
      __HAL_RCC_TIM10_CLK_DISABLE();
  }
#endif
#if defined(TIM11_BASE)
  if (htim->Instance == TIM11) {
      __HAL_RCC_TIM11_CLK_DISABLE();
  }
#endif
#if defined(TIM12_BASE)
  if (htim->Instance == TIM12) {
      __HAL_RCC_TIM12_CLK_DISABLE();
  }
#endif
#if defined(TIM13_BASE)
  if (htim->Instance == TIM13) {
      __HAL_RCC_TIM13_CLK_DISABLE();
  }
#endif
#if defined(TIM14_BASE)
  if (htim->Instance == TIM14) {
      __HAL_RCC_TIM14_CLK_DISABLE();
  }
#endif
#if defined(TIM15_BASE)
  if (htim->Instance == TIM15) {
      __HAL_RCC_TIM15_CLK_DISABLE();
  }
#endif
#if defined(TIM16_BASE)
  if (htim->Instance == TIM16) {
      __HAL_RCC_TIM16_CLK_DISABLE();
  }
#endif
#if defined(TIM17_BASE)
  if (htim->Instance == TIM17) {
      __HAL_RCC_TIM17_CLK_DISABLE();
  }
#endif
#if defined(TIM18_BASE)
  if (htim->Instance == TIM18) {
      __HAL_RCC_TIM18_CLK_DISABLE();
  }
#endif
#if defined(TIM19_BASE)
  if (htim->Instance == TIM19) {
      __HAL_RCC_TIM19_CLK_DISABLE();
  }
#endif
#if defined(TIM20_BASE)
  if (htim->Instance == TIM20) {
      __HAL_RCC_TIM20_CLK_DISABLE();
  }
#endif
#if defined(TIM21_BASE)
  if (htim->Instance == TIM21) {
      __HAL_RCC_TIM21_CLK_DISABLE();
  }
#endif
#if defined(TIM22_BASE)
  if (htim->Instance == TIM22) {
      __HAL_RCC_TIM22_CLK_DISABLE();
  }
#endif
}

/**
  * @brief  TIMER Initialization - clock init and nvic init
  * @param  htim_base : one of the defined timer
  * @retval None
  */
void HAL_TIM_Base_MspInit(TIM_HandleTypeDef *htim_base)
{
  timer_enable_clock(htim_base);

  HAL_NVIC_SetPriority(getTimerIrq(htim_base->Instance), 15 ,0);
  HAL_NVIC_EnableIRQ(getTimerIrq(htim_base->Instance));
}

/**
  * @brief  TIMER Deinitialization - clock and nvic
  * @param  htim_base : one of the defined timer
  * @retval None
  */
void HAL_TIM_Base_MspDeInit(TIM_HandleTypeDef *htim_base)
{
  timer_disable_clock(htim_base);
  HAL_NVIC_DisableIRQ(getTimerIrq(htim_base->Instance));
}

/**
  * @brief  This function will set the timer to the required value
  * @param  timer_id : timer_id_e
  * @param  period : Timer period in milliseconds
  * @param  prescaler : clock divider
  * @retval None
  */
void TimerHandleInit(stimer_t *obj, uint16_t period, uint16_t prescaler)
{
  if(obj == NULL)
    return;

  TIM_HandleTypeDef *handle = &(obj->handle);

