stm32duino/Arduino_Core_STM32/cores/arduino/stm32/timer.c
  handle->Instance               = obj->timer;
  handle->Init.Prescaler         = prescaler;
  handle->Init.CounterMode       = TIM_COUNTERMODE_UP;
  handle->Init.Period            = period;
  handle->Init.ClockDivision     = TIM_CLOCKDIVISION_DIV1;
#if !defined(STM32L0xx) && !defined(STM32L1xx)
  handle->Init.RepetitionCounter = 0x0000;
#endif
  if(HAL_TIM_Base_Init(handle) != HAL_OK){
    return;
  }

  if(HAL_TIM_Base_Start_IT(handle) != HAL_OK){
    return;
  }
}

/**
  * @brief  This function return the timer clock source.
  * @param  tim: timer instance
  * @retval 1 = PCLK1 or 2 = PCLK2 or 0 = unknown
  */
uint32_t getTimerIrq(TIM_TypeDef* tim)
{
  uint32_t IRQn = 0;

  if(tim != (TIM_TypeDef *)NC) {
    /* Get IRQn depending on TIM instance */
    switch ((uint32_t)tim) {
#if defined(TIM1_BASE)
       case (uint32_t)TIM1:
         IRQn = TIM1_IRQn;
         break;
#endif
#if defined(TIM2_BASE)
       case (uint32_t)TIM2:
         IRQn = TIM2_IRQn;
         break;
#endif
#if defined(TIM3_BASE)
       case (uint32_t)TIM3:
         IRQn = TIM3_IRQn;
         break;
#endif
#if defined(TIM4_BASE)
       case (uint32_t)TIM4:
         IRQn = TIM4_IRQn;
         break;
#endif
#if defined(TIM5_BASE)
       case (uint32_t)TIM5:
         IRQn = TIM5_IRQn;
         break;
#endif
#if defined(TIM6_BASE)
       case (uint32_t)TIM6:
         IRQn = TIM6_IRQn;
         break;
#endif
#if defined(TIM7_BASE)
       case (uint32_t)TIM7:
         IRQn = TIM7_IRQn;
         break;
#endif
#if defined(TIM8_BASE)
       case (uint32_t)TIM8:
         IRQn = TIM8_IRQn;
         break;
#endif
#if defined(TIM9_BASE)
       case (uint32_t)TIM9:
         IRQn = TIM9_IRQn;
         break;
#endif
#if defined(TIM10_BASE)
       case (uint32_t)TIM10:
         IRQn = TIM10_IRQn;
         break;
#endif
#if defined(TIM11_BASE)
       case (uint32_t)TIM11:
         IRQn = TIM11_IRQn;
         break;
#endif
#if defined(TIM12_BASE)
       case (uint32_t)TIM12:
         IRQn = TIM12_IRQn;
         break;
#endif
#if defined(TIM13_BASE)
       case (uint32_t)TIM13:
         IRQn = TIM13_IRQn;
         break;
#endif
#if defined(TIM14_BASE)
       case (uint32_t)TIM14:
         IRQn = TIM14_IRQn;
         break;
#endif
#if defined(TIM15_BASE)
       case (uint32_t)TIM15:
         IRQn = TIM15_IRQn;
         break;
#endif
#if defined(TIM16_BASE)
       case (uint32_t)TIM16:
         IRQn = TIM16_IRQn;
         break;
#endif
#if defined(TIM17_BASE)
       case (uint32_t)TIM17:
         IRQn = TIM17_IRQn;
         break;
#endif
#if defined(TIM18_BASE)
       case (uint32_t)TIM18:
         IRQn = TIM18_IRQn;
         break;
#endif
#if defined(TIM19_BASE)
       case (uint32_t)TIM19:
         IRQn = TIM19_IRQn;
         break;
#endif
#if defined(TIM20_BASE)
       case (uint32_t)TIM20:
         IRQn = TIM20_IRQn;
         break;
#endif
#if defined(TIM21_BASE)
       case (uint32_t)TIM21:
         IRQn = TIM21_IRQn;
         break;
#endif
#if defined(TIM22_BASE)
       case (uint32_t)TIM22:
         IRQn = TIM22_IRQn;
         break;
#endif
         break;
     default:
        printf("TIM: Unknown timer IRQn");
        break;
    }
  }
  return IRQn;
}

/**
  * @brief  This function will reset the timer
  * @param  timer_id : timer_id_e
  * @retval None
  */
void TimerHandleDeinit(stimer_t *obj)
{
  HAL_TIM_Base_DeInit(&(obj->handle));
  HAL_TIM_Base_Stop_IT(&(obj->handle));
}

/**
  * @brief  This function return the timer clock source.
  * @param  tim: timer instance
  * @retval 1 = PCLK1 or 2 = PCLK2 or 0 = unknown
  */
uint8_t getTimerClkSrc(TIM_TypeDef* tim)
{
  uint8_t clkSrc = 0;

  if(tim != (TIM_TypeDef *)NC)
#ifdef STM32F0xx
    /* TIMx source CLK is PCKL1 */
    clkSrc = 1;
#else
  {
    /* Get source clock depending on TIM instance */
    switch ((uint32_t)tim) {
#if defined(TIM2_BASE)
       case (uint32_t)TIM2:
#endif
#if defined(TIM3_BASE)
       case (uint32_t)TIM3:
#endif
#if defined(TIM4_BASE)
       case (uint32_t)TIM4:
#endif
#if defined(TIM5_BASE)
       case (uint32_t)TIM5:
#endif
#if defined(TIM6_BASE)
       case (uint32_t)TIM6:
#endif
#if defined(TIM7_BASE)
       case (uint32_t)TIM7:
#endif
#if defined(TIM12_BASE)
       case (uint32_t)TIM12:
#endif
#if defined(TIM13_BASE)
       case (uint32_t)TIM13:
#endif
#if defined(TIM14_BASE)
       case (uint32_t)TIM14:
#endif
#if defined(TIM18_BASE)
       case (uint32_t)TIM18:
#endif
         clkSrc = 1;
         break;
#if defined(TIM1_BASE)
       case (uint32_t)TIM1:
#endif
#if defined(TIM8_BASE)
       case (uint32_t)TIM8:
#endif
#if defined(TIM9_BASE)
       case (uint32_t)TIM9:
#endif
#if defined(TIM10_BASE)
       case (uint32_t)TIM10:
#endif
#if defined(TIM11_BASE)
       case (uint32_t)TIM11:
#endif
#if defined(TIM15_BASE)
       case (uint32_t)TIM15:
#endif
#if defined(TIM16_BASE)
       case (uint32_t)TIM16:
#endif
#if defined(TIM17_BASE)
       case (uint32_t)TIM17:
#endif
#if defined(TIM19_BASE)
       case (uint32_t)TIM19:
#endif
#if defined(TIM20_BASE)
       case (uint32_t)TIM20:
#endif
#if defined(TIM21_BASE)
       case (uint32_t)TIM21:
#endif
#if defined(TIM22_BASE)
       case (uint32_t)TIM22:
#endif
         clkSrc = 2;
         break;
     default:
        printf("TIM: Unknown timer instance");
        break;
    }
  }
#endif
  return clkSrc;
}

/**
  * @brief  This function return the timer clock frequency.
  * @param  tim: timer instance
  * @retval frequency in Hz
  */
uint32_t getTimerClkFreq(TIM_TypeDef* tim)
{
  RCC_ClkInitTypeDef    clkconfig = {};
  uint32_t              pFLatency = 0U;
  uint32_t              uwTimclock = 0U, uwAPBxPrescaler = 0U;

  /* Get clock configuration */
  HAL_RCC_GetClockConfig(&clkconfig, &pFLatency);
  switch(getTimerClkSrc(tim)) {
    case 1:
      uwAPBxPrescaler = clkconfig.APB1CLKDivider;
      uwTimclock = HAL_RCC_GetPCLK1Freq();
      break;
#ifndef STM32F0xx
    case 2:
      uwAPBxPrescaler = clkconfig.APB2CLKDivider;
      uwTimclock = HAL_RCC_GetPCLK2Freq();
      break;
#endif
    default:
    case 0:
      printf("TIM: Unknown clock source");
      break;
  }
/* When TIMPRE bit of the RCC_DCKCFGR register is reset,
 *   if APBx prescaler is 1, then TIMxCLK = PCLKx,
 *   otherwise TIMxCLK = 2x PCLKx.
 * When TIMPRE bit in the RCC_DCKCFGR register is set,
 *   if APBx prescaler is 1,2 or 4, then TIMxCLK =HCLK,
 *   otherwise TIMxCLK = 4x PCLKx
 */
#if defined(STM32F4xx) || defined(STM32F7xx)
#if !defined(STM32F405xx) && !defined(STM32F415xx) &&\
    !defined(STM32F407xx) && !defined(STM32F417xx)
  RCC_PeriphCLKInitTypeDef PeriphClkConfig = {};
  HAL_RCCEx_GetPeriphCLKConfig(&PeriphClkConfig);

  if (PeriphClkConfig.TIMPresSelection == RCC_TIMPRES_ACTIVATED)
    switch (uwAPBxPrescaler) {
      default:
      case RCC_HCLK_DIV1:
      case RCC_HCLK_DIV2:
      case RCC_HCLK_DIV4:
        uwTimclock=HAL_RCC_GetHCLKFreq();
        break;
      case RCC_HCLK_DIV8:
      case RCC_HCLK_DIV16:
        uwTimclock*=4;
        break;
    }
  else
#endif
#endif
    switch (uwAPBxPrescaler) {
      default:
      case RCC_HCLK_DIV1:
        // uwTimclock*=1;
        break;
      case RCC_HCLK_DIV2:
      case RCC_HCLK_DIV4:
      case RCC_HCLK_DIV8:
      case RCC_HCLK_DIV16:
        uwTimclock*=2;
        break;
    }
  return uwTimclock;
}

/**
  * @brief  This function will set the timer to generate pulse in interrupt mode with a particular duty cycle
  * @param  timer_id : timer_id_e
  * @param  period : timer period in microseconds
  * @param  pulseWidth : pulse width in microseconds
  * @param  irqHandle : interrupt routine to call
  * @retval None
  */
void TimerPulseInit(stimer_t *obj, uint16_t period, uint16_t pulseWidth, void (*irqHandle)(stimer_t*, uint32_t))
{
  TIM_OC_InitTypeDef sConfig = {};
  TIM_HandleTypeDef *handle = &(obj->handle);

  obj->timer = TIMER_SERVO;

  //min pulse = 1us - max pulse = 65535us
  handle->Instance               = obj->timer;
  handle->Init.Period            = period;
  handle->Init.Prescaler         = (uint32_t)(getTimerClkFreq(obj->timer) / (1000000)) - 1;
  handle->Init.ClockDivision     = 0;
  handle->Init.CounterMode       = TIM_COUNTERMODE_UP;
#if !defined(STM32L0xx) && !defined(STM32L1xx)
  handle->Init.RepetitionCounter = 0;
#endif
  obj->irqHandleOC = irqHandle;

