stm32duino/Arduino_Core_STM32/cores/arduino/stm32/timer.c
  sConfig.OCMode        = TIM_OCMODE_TIMING;
  sConfig.Pulse         = pulseWidth;
  sConfig.OCPolarity    = TIM_OCPOLARITY_HIGH;
  sConfig.OCFastMode    = TIM_OCFAST_DISABLE;
#if !defined(STM32L0xx) && !defined(STM32L1xx)
  sConfig.OCNPolarity   = TIM_OCNPOLARITY_HIGH;
  sConfig.OCIdleState   = TIM_OCIDLESTATE_RESET;
  sConfig.OCNIdleState  = TIM_OCNIDLESTATE_RESET;
#endif
  HAL_NVIC_SetPriority(getTimerIrq(obj->timer), 14, 0);
  HAL_NVIC_EnableIRQ(getTimerIrq(obj->timer));

  if(HAL_TIM_OC_Init(handle) != HAL_OK) return;

  if(HAL_TIM_OC_ConfigChannel(handle, &sConfig, TIM_CHANNEL_1) != HAL_OK) return;
  if(HAL_TIM_OC_Start_IT(handle, TIM_CHANNEL_1) != HAL_OK) return;
}

/**
  * @brief  This function will reset the pulse generation
  * @param  timer_id : timer_id_e
  * @retval None
  */
void TimerPulseDeinit(stimer_t *obj)
{
  TIM_HandleTypeDef *handle = &(obj->handle);

  obj->irqHandleOC = NULL;

  HAL_NVIC_DisableIRQ(getTimerIrq(obj->timer));

  if(HAL_TIM_OC_DeInit(handle) != HAL_OK) return;
  if(HAL_TIM_OC_Stop_IT(handle, TIM_CHANNEL_1) != HAL_OK) return;
}

/**
  * @brief  Initializes the TIM Output Compare MSP.
  * @param  htim: TIM handle
  * @retval None
  */
void HAL_TIM_OC_MspInit(TIM_HandleTypeDef *htim)
{
  timer_enable_clock(htim);
}

/**
  * @brief  DeInitialize TIM Output Compare MSP.
  * @param  htim: TIM handle
  * @retval None
  */
void HAL_TIM_OC_MspDeInit(TIM_HandleTypeDef *htim)
{
  timer_disable_clock(htim);
}

/* Aim of the function is to get timer_s pointer using htim pointer */
/* Highly inspired from magical linux kernel's "container_of" */
/* (which was not directly used since not compatible with IAR toolchain) */
stimer_t *get_timer_obj(TIM_HandleTypeDef *htim){
    struct timer_s *obj_s;
    stimer_t *obj;

    obj_s = (struct timer_s *)( (char *)htim - offsetof(struct timer_s,handle));
    obj = (stimer_t *)( (char *)obj_s - offsetof(stimer_t,timer));

    return (obj);
}

/**
  * @brief  Output Compare callback in non-blocking mode
  * @param  htim : TIM OC handle
  * @retval None
  */
void HAL_TIM_OC_DelayElapsedCallback(TIM_HandleTypeDef *htim)
{
  uint32_t channel = 0;
  stimer_t *obj = get_timer_obj(htim);

  if(obj->irqHandleOC != NULL) {
    switch(htim->Channel) {
      case HAL_TIM_ACTIVE_CHANNEL_1:
        channel = TIM_CHANNEL_1 / 4;
      break;
      default:
        return;
      break;
    }
      obj->irqHandleOC(obj, channel);
  }
}

/**
  * @brief  Period elapsed callback in non-blocking mode
  * @param  timer_id : id of the timer
  * @retval None
  */
void HAL_TIMx_PeriodElapsedCallback(stimer_t *obj)
{

  if(get_GPIO_Port(STM_PORT(obj->pin)) != NULL) {
    if(obj->pinInfo.count > 0){
      obj->pinInfo.count--;

      if(obj->pinInfo.state == 0) {
        obj->pinInfo.state = 1;
        digital_io_write(get_GPIO_Port(STM_PORT(obj->pin)), STM_GPIO_PIN(obj->pin), 1);
      }
      else {
        obj->pinInfo.state = 0;
        digital_io_write(get_GPIO_Port(STM_PORT(obj->pin)), STM_GPIO_PIN(obj->pin), 0);
      }
    }
    else if(obj->pinInfo.count == -1) {
      if(obj->pinInfo.state == 0) {
        obj->pinInfo.state = 1;
        digital_io_write(get_GPIO_Port(STM_PORT(obj->pin)), STM_GPIO_PIN(obj->pin), 1);
      }
      else {
        obj->pinInfo.state = 0;
        digital_io_write(get_GPIO_Port(STM_PORT(obj->pin)), STM_GPIO_PIN(obj->pin), 0);
      }
    }
    else {
      digital_io_write(get_GPIO_Port(STM_PORT(obj->pin)), STM_GPIO_PIN(obj->pin), 0);
    }
  }
}

/**
  * @brief  Period elapsed callback in non-blocking mode
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  stimer_t *obj = get_timer_obj(htim);

  if(obj->irqHandle != NULL) {
      obj->irqHandle(obj);
  }
}

/**
  * @brief  This function will set the tone timer to the required value and
  *         configure the pin to toggle.
  * @param  port : pointer to GPIO_TypeDef
  * @param  pin : pin number to toggle
  * @param  frequency : toggle frequency (in hertz)
  * @param  duration : toggle time
  * @retval None
  */
void TimerPinInit(stimer_t *obj, uint32_t frequency, uint32_t duration)
{
  uint8_t end = 0;
  uint32_t timClkFreq = 0;
  // TIMER_TONE freq is twice frequency
  uint32_t timFreq = 2*frequency;
  uint32_t prescaler = 1;
  uint32_t period = 0;

  if(frequency > MAX_FREQ)
    return;

  obj->timer = TIMER_TONE;
  obj->pinInfo.state = 0;

  //Calculate the toggle count
  if (duration > 0) {
    obj->pinInfo.count = ((timFreq * duration) / 1000);
  }
  else {
    obj->pinInfo.count = -1;
  }

  digital_io_init(obj->pin, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL);
  timClkFreq = getTimerClkFreq(obj->timer);

  while(end == 0) {
    period = ((uint32_t)( timClkFreq / timFreq / prescaler)) - 1;

    if((period >= 0xFFFF) && (prescaler < 0xFFFF))
      prescaler++; //prescaler *= 2;

    else
      end = 1;
  }

  if((period < 0xFFFF) && (prescaler < 0xFFFF)) {
    obj->irqHandle = HAL_TIMx_PeriodElapsedCallback;
    TimerHandleInit(obj, period, prescaler-1);
  }
  else {
    TimerHandleDeinit(obj);
  }
}

/**
  * @brief  This function will reset the tone timer
  * @param  port : pointer to port
  * @param  pin : pin number to toggle
  * @retval None
  */
void TimerPinDeinit(stimer_t *obj)
{
  TimerHandleDeinit(obj);
}

/**
  * @brief  Get the counter value.
  * @param  timer_id : id of the timer
  * @retval Counter value
  */
uint32_t getTimerCounter(stimer_t *obj)
{
  return __HAL_TIM_GET_COUNTER(&(obj->handle));
}

/**
  * @brief  Set the counter value.
  * @param  timer_id : id of the timer
  * @param  value : counter value
  * @retval None
  */
void setTimerCounter(stimer_t *obj, uint32_t value)
{
  __HAL_TIM_SET_COUNTER(&(obj->handle), value);
}

/**
  * @brief  Set the TIM Capture Compare Register value.
  * @param  timer_id : id of the timer
  * @param  channel : TIM Channels to be configured.
  * @param  value : register new register.
  * @retval None
  */
void setCCRRegister(stimer_t *obj, uint32_t channel, uint32_t value)
{
  __HAL_TIM_SET_COMPARE(&(obj->handle), channel*4, value);
}

/**
  * @brief  Set the TIM Capture Compare Register value.
  * @param  timer_id : id of the timer
  * @param  channel : TIM Channels to be configured.
  * @retval CRR value.
  */
uint32_t getCCRRegister(stimer_t *obj, uint32_t channel)
{
  return __HAL_TIM_GET_COMPARE(&(obj->handle), channel);
}

/**
  * @brief  Attached an interrupt handler
  * @param  timer_id : id of the timer
  * @param  irqHandle : interrupt handler
  * @retval none
  */
void attachIntHandle(stimer_t *obj, void (*irqHandle)(stimer_t *))
{
  obj->irqHandle = irqHandle;
}


/******************************************************************************/
/*                            TIMx IRQ HANDLER                                */
/******************************************************************************/

#if defined(TIM1_BASE)
/**
  * @brief  TIM1 IRQHandler common with TIM10 and TIM16 on some STM32F1xx
  * @param  None
  * @retval None
  */
void TIM1_IRQHandler(void)
{
  if(timer_handles[0] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[0]);
  }

#if defined(STM32F1xx) || defined(STM32F2xx) || defined(STM32F4xx) || defined(STM32F7xx)
#if defined (TIM10_BASE)
  if(timer_handles[9] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[9]);
  }
#endif
#endif

#if defined(STM32F1xx) || defined(STM32F3xx) || defined(STM32L4xx)
#if defined (TIM16_BASE)
  if(timer_handles[15] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[15]);
  }
#endif
#endif
}
#endif //TIM1_BASE

#if defined(TIM2_BASE)
/**
  * @brief  TIM2 IRQHandler
  * @param  None
  * @retval None
  */
void TIM2_IRQHandler(void)
{
  if(timer_handles[1] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[1]);
  }
}
#endif //TIM2_BASE

#if defined(TIM3_BASE)
/**
  * @brief  TIM3 IRQHandler
  * @param  None
  * @retval None
  */
void TIM3_IRQHandler(void)
{
  if(timer_handles[2] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[2]);
  }
}
#endif //TIM3_BASE

#if defined(TIM4_BASE)
/**
  * @brief  TIM4 IRQHandler
  * @param  None
  * @retval None
  */
void TIM4_IRQHandler(void)
{
  if(timer_handles[3] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[3]);
  }
}
#endif //TIM4_BASE

#if defined(TIM5_BASE)
/**
  * @brief  TIM5 IRQHandler
  * @param  None
  * @retval None
  */
void TIM5_IRQHandler(void)
{
  if(timer_handles[4] != NULL) {
    HAL_TIM_IRQHandler(timer_handles[4]);
  }
}
#endif //TIM5_BASE

